import React from "react";

const courtOffices = [
    "Улсын дээд шүүхийн Тамгын газар",
    "Нийслэлийн давж заалдах шатны шүүхийн Тамгын газар",
    "Захиргааны хэргийн давж заалдах шатны шүүхийн Тамгын газар",
    "Баянзүрх дүүргийн Иргэний хэргийн анхан шатны шүүхийн Тамгын газар",
    "Баянзүрх, Сүхбаатар, Чингэлтэй дүүргийн Эрүүгийн хэргийн анхан шатны шүүхийн Тамгын газар",
    "Баянгол, Хан-Уул дүүргийн Иргэний хэргийн анхан шатны шүүхийн Тамгын газар",
    "Баянгол, Хан-Уул дүүргийн Иргэний хэргийн анхан шатны шүүхийн Тамгын газар",
    "Багахангай, Налайх дүүргийн шүүхийн Тамгын газар",
    "Багануур дүүргийн шүүхийн Тамгын газар",
    "Сүхбаатар, Чингэлтэй дүүргийн Иргэний хэргийн анхан шатны шүүхийн Тамгын газар",
    "Сонгинохайрхан дүүргийн Иргэний хэргийн анхан шатны шүүхийн Тамгын газар",
    "Нийслэл дэх Захиргааны хэргийн анхан шатны шүүхийн Тамгын газар",
    "Архангай аймаг дахь шүүхийн Тамгын газар",
    "Баян-Өлгий аймаг дахь шүүхийн Тамгын газар",
    "Баянхонгор аймаг дахь шүүхийн Тамгын газар",
    "Булган аймаг дахь шүүхийн Тамгын газар",
    "Говь-Алтай аймаг дахь шүүхийн Тамгын газар",
    "Говьсүмбэр аймаг дахь шүүхийн Тамгын газар",
    "Дархан-Уул аймаг дахь давж заалдах шатны болон Захиргааны хэргийн анхан шатны шүүхийн Тамгын газар",
    "Дархан-Уул аймаг дахь сум дундын шүүхийн Тамгын газар",
    "Дорнод аймаг дахь шүүхийн Тамгын газар",
    "Дорноговь аймаг дахь шүүхийн Тамгын газар",
    "Дорноговь аймгийн Замын-Үүд сум дахь Сум дундын шүүхийн Тамгын газар",
    "Дундговь аймаг дахь шүүхийн Тамгын газар",
    "Завхан аймаг дахь шүүхийн Тамгын газар",
    "Завхан аймгийн Тосонцэнгэл сум дахь Сум дундын шүүхийн Тамгын газар",
    "Орхон аймаг дахь шүүхийн Тамгын газар",
    "Өвөрхангай аймаг дахь шүүхийн Тамгын газар",
    "Өвөрхангай аймгийн Хархорин сум дахь Сум дундын шүүхийн Тамгын газар",
    "Өмнөговь аймаг дахь шүүхийн Тамгын газар",
    "Өмнөговь аймгийн Ханбогд сум дахь Сум дундын шүүхийн Тамгын газар",
    "Сүхбаатар аймаг дахь шүүхийн Тамгын газар",
    "Сэлэнгэ аймаг дахь шүүхийн Тамгын газар",
    "Сэлэнгэ аймгийн Мандал сум дахь Сум дундын шүүхийн Тамгын газар",
    "Сэлэнгэ аймгийн Сайхан сум дахь Сум дундын шүүхийн Тамгын газар",
    "Төв аймаг дахь шүүхийн Тамгын газар",
    "Увс аймаг дахь шүүхийн Тамгын газар",
    "Ховд аймаг дахь шүүхийн Тамгын газар",
    "Ховд аймгийн Булган сум дахь Сум дундын шүүхийн Тамгын газар",
    "Хөвсгөл аймаг дахь шүүхийн Тамгын газар",
    "Хэнтий аймаг дахь шүүхийн Тамгын газар",
    "Хэнтий аймгийн Бор-Өндөр сум дахь Сум дундын шүүхийн Тамгын газар",
];

const JudgementSection = () => {
    return (
        <div className="py-7 bg-white px-52 md:px-20 border-1 border-t">
            <div className="flex justify-between">
                <p className="font-semibold text-lg">Шүүхийн тамгын газар</p>
            </div>
            <ul className="grid grid-cols-3 gap-4 p-4 list-disc pl-6">
                {courtOffices.map((office, index) => (
                    <li key={index} className="text-sm">
                        <a
                            href="#"
                            className="hover:text-bluePanda flex items-center"
                        >
                            {office}
                        </a>
                    </li>
                ))}
            </ul>
        </div>
    );
};

export default JudgementSection;
